{
  "heading": "Reliable, Meticulous, Passionate",
  "subheading": "I'm a frontend developer who aim to craft sophisticated and purposeful websites, driven by the belief that well-leveraged technology can enhance people's everyday lives.",
  "location": "Taiwan",
  "blog": "articles",
  "get-in-touch": "Get in touch",
  "resume": "Resume",
  "resume-pdf": "./pdf/Resume_Front-end Developer_Angela Lee 20250624.pdf",
  "view-more": "View More",
  "hide": "Hide",
  "check-out-site": "Check Out the Live Site!",
  "about-me": "About Me",
  "description": "My focus lies in creating code that is reusable, readable, and scalable as well as delving into fundamental logic, ensuring a solid understanding of the core principles which all drive me to create efficient and reliable solutions that can contribute to the long-term success of any project. \nIn a team, I am a logical executor, bringing stability and coordination to drive the team forward. With my steady and meticulous style, I can bring strong commitment to delivering well-structured solutions to your technical and business goals. ",
  "articles": "Articles",
  "article-list": [
    {
      "title": "Variable declaration and the difference between var, let, const",
      "url": "https://angela-tylee.notion.site/var-let-const-1b98d159628880dbb66ace4ec80e72bd"
    },
    {
      "title": "What is Scope? Hoisting, Shadowing, Lexical Scope, TDZ, Parameter Delivery",
      "url": "https://angela-tylee.notion.site/Scope-Hoisting-Shadowing-Lexical-Scope-TDZ-1388d159628880f79e00dcdf915dbc7b"
    },
    {
      "title": "Expression vs Statement, Function Statement vs Function Expression",
      "url": "https://angela-tylee.notion.site/Expression-vs-Statement-vs-1b98d1596288808087f7d0f9528e4c7c"
    },
    {
      "title": "Data Type: Type Conversion and Comparison, True and False Values",
      "url": "https://angela-tylee.notion.site/Type-Conversion-1388d1596288806199eae83501bc7a45"
    },
    {
      "title": "Objects: Why Can't Objects Be Equal? Call-by-Value vs. Call-by-Reference vs. Call-by-Sharing",
      "url": "https://angela-tylee.notion.site/vs-1438d159628880638deac735dbd5a26d"
    },
    {
      "title": "Understanding JavaScript's this: When and How to Use It Correctly",
      "url": "https://angela-tylee.notion.site/this-this-1438d159628880d8a7a1e8c333a28daa"
    }
  ],
  "projects": "Other Mini Projects",
  "know-more": "Know More about Me",
  "ready-challenge": "Ready to Tackle Any Technical Challenges.",
  "ecommerce": {
    "title": "E-commerce Website: Carpento",
    "description": "Selling furniture online, from showcasing the products, browsing the details to finishing the checkout flow.",
    "key-points": [
      "Developed with <strong>React, CRA, Bootstrap</strong>, consisting of <strong>~8,500 lines</strong> of well-structured source code.",
      "Integrated with <strong>20+ APIs</strong>, GET, POST, DELETE, and PUT to modify product and shopping cart states...etc.",
      "Follow modular principles, including reusable component system, maintainable SCSS styling, and a clean file architecture for maintainability.",
      "<strong>10+</strong> reusable components and custom hooks, reduced <strong>18%</strong> total lines of codes, enhanced code readability and maintainability.",
      "Consolidate packages including Swiper, CKEditor, React Hook Form, enhance the readability and maintainability, also improved user experience."
    ],
    "products": "Find a product, add to cart, and checkout!",
    "dark-mode": "Switch light / dark mode as you want!",
    "blog": "Add relevant contents about this brand to attract more potential customers",
    "dashboard": "Easily manage product, orders, blog contents, and coupons from admin dashboard."
  }
}